Revit 2027 API
ACADExportOptions.HatchBackgroundColor Property
 The color that will be set as hatch backgound color on the exported hatch. This color will be used only if useHatchBackgroundColor is true. default value is white
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color HatchBackgroundColor { get; set; }
Public Property HatchBackgroundColor As Color
	Get
	Set
public:
property Color^ HatchBackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
member HatchBackgroundColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace